Functions
Renovation
Functions related to accessing and changing the Renovation settings. More...
 Functions
GSErrCode __ACENV_CALL  | ACAPI_Renovation_GetActualRenovationFilter (API_Guid *renovationFilterGuid)
Returns the current renovation filter.
GSErrCode __ACENV_CALL  | ACAPI_Renovation_SetActualRenovationFilter (const API_Guid *renovationFilterGuid)
Changes the current renovation filter.
GSErrCode __ACENV_CALL  | ACAPI_Renovation_GetRenovationFilters (GS::Array< API_Guid > *renovationFilterList)
Returns the array of renovation filters.
GSErrCode __ACENV_CALL  | ACAPI_Renovation_GetRenovationStatusName (API_RenovationStatusType renovationStatusType, GS::UniString *statusName)
Returns the name of the renovation status.
GSErrCode __ACENV_CALL  | ACAPI_Renovation_GetRenovationFilterName (const API_Guid *renovationFilterGuid, GS::UniString *renovationFilterName)
Returns the name of the renovation filter.
Detailed Description
Functions related to accessing and changing the Renovation settings.
Function Documentation
◆ ACAPI_Renovation_GetActualRenovationFilter()
 GSErrCode __ACENV_CALL ACAPI_Renovation_GetActualRenovationFilter  |  ( |  API_Guid *  |  renovationFilterGuid | )
Returns the current renovation filter.
Parameters
renovationFilterGuid | [out] The GUID of the current renovation filter.
Returns
NoError - The function has completed with success.
Remarks
This function returns the Guid of the current renovation filter. The list of the renovation filters can be retrieved with the ACAPI_Renovation_GetRenovationFilters function.
◆ ACAPI_Renovation_GetRenovationFilterName()
 GSErrCode __ACENV_CALL ACAPI_Renovation_GetRenovationFilterName  |  ( |  const API_Guid *  |  renovationFilterGuid,
|  GS::UniString *  |  renovationFilterName
)
Returns the name of the renovation filter.
Parameters
renovationFilterGuid | [in] The GUID of the renovation filter.
renovationFilterName | [out] The localized name of the renovation filter.
Returns
NoError - The function has completed with success.
Remarks
The user may create any number of renovation filters; use this function to retrieve their names. The list of the renovation filters can be retrieved with the ACAPI_Renovation_GetRenovationFilters function.
◆ ACAPI_Renovation_GetRenovationFilters()
 GSErrCode __ACENV_CALL ACAPI_Renovation_GetRenovationFilters  |  ( |  GS::Array< API_Guid > *  |  renovationFilterList | )
Returns the array of renovation filters.
Parameters
renovationFilterList | [out] The array of renovation filters.
Returns
NoError - The function has completed with success.
APIERR_BADPARS - The renovationFilterList parameter is nullptr.
Remarks
This function returns the renovation filters as an array of Guids. To get the current renovation filter use the ACAPI_Renovation_GetActualRenovationFilter function. The name of the renovation filter can be retrieved with the ACAPI_Renovation_GetRenovationFilterName function.
Example
GS::Array<API_Guid> renFilters;
err = ACAPI_Database (APIDb_GetRenovationFiltersID, &renFilters);
if (err == NoError) {
 GS::USize nRenFilters = renFilters.GetSize ();
 for (GS::UIndex i = 0; i < nRenFilters; ++i) {
 if (oldView.renovationFilterGuid == renFilters[i]) {
 newView.renovationFilterGuid = renFilters[i + 1 >= nRenFilters ? 0 : i + 1];
 break;
 }
 }
}
◆ ACAPI_Renovation_GetRenovationStatusName()
 GSErrCode __ACENV_CALL ACAPI_Renovation_GetRenovationStatusName  |  ( |  API_RenovationStatusType  |  renovationStatusType,
|  GS::UniString *  |  statusName
)
Returns the name of the renovation status.
Parameters
renovationStatusType | [in] The renovation status you are interested in.
statusName | [out] The localized name of the renovation status.
Returns
NoError - The function has completed with success.
◆ ACAPI_Renovation_SetActualRenovationFilter()
 GSErrCode __ACENV_CALL ACAPI_Renovation_SetActualRenovationFilter  |  ( |  const API_Guid *  |  renovationFilterGuid | )
Changes the current renovation filter.
Since
Archicad 25
Parameters
renovationFilterGuid | [in] The GUID of the new renovation filter.
Returns
NoError - The function has completed with success.
Remarks
This function is changing the current renovation filter. The list of the renovation filters can be retrieved with the ACAPI_Renovation_GetRenovationFilters function.